OdDAI.Repository.writeStream(OdSmartPtr&lt;OdStreamBuf&gt;,System.Boolean)
\details
Writes data from the specified stream buffer to a physical file.
\param pStream      [in] A smart pointer to the output stream buffer object to wtite data.
\param saveLogFile  [in] A flag that determines whether the log file should also be written (if equal to true) or not (if equal to false).
\returns eOk if the data is successfully written; otherwise, the method returns an appropriate error code.
\remarks
This method does not support writing to Zip format.

OdDAI.Repository.writeFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Writes data from the repository object to a physical file.
\param filename     [in] A string that contains the full path to the output file to write data.
\param saveLogFile  [in] A flag that determines whether the log file should also be written (if equal to true) or not (if equal to false).
\returns eOk if the data is successfully written; otherwise, the method returns an appropriate error.

OdDAI.Repository.readStream(OdSmartPtr&lt;OdStreamBuf&gt;,OdSmartPtr&lt;OdDAI.Schema&gt;!System.Runtime.CompilerServices.IsConst)
\details
Reads data from a specified stream buffer.
\param pStream    [in] A smart pointer to the stream buffer  object to read data from.
\param schema     [in] Smart pointer to a schema.
\returns eOk if the data is successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.readStream(OdSmartPtr&lt;OdStreamBuf&gt;,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Reads data from a specified stream buffer.
\param pStream    [in] A smart pointer to the stream buffer  object to read data from.
\param schemaName [in] Schema name.
\returns eOk if the data is successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.readStream(OdSmartPtr&lt;OdStreamBuf&gt;)
\details
Reads data from a specified stream buffer.
\param pStream [in] A smart pointer to the stream buffer  object to read data from.
\returns eOk if the data is successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.readBuffer(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates the repository from a memory buffer that contains STEP Physical File (*.spf) data.
\param spfBuf [in] A char array that contains buffered data of the model in the STEP Physical File representation.
\returns eOk if the data is successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSmartPtr&lt;OdDAI.Schema&gt;!System.Runtime.CompilerServices.IsConst)
\details
Creates the repository from a STEP Physical File (*.spf) with specified schema.
\param fileName [in] A string that contains the file name.
\param schema [in] valid smart pointer to schema definition
\returns eOk if the data content is successfully read; otherwise, the method returns an appropriate error code.
\remarks
The successful result of force reading with not native schema for a file isn't guaranteed as different schemas may be not compatible with each other.

OdDAI.Repository.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates the repository from a STEP Physical File (*.spf) with specified schema.
\param fileName [in] A string that contains the file name.
\param schemaName [in] valid schema name
\returns eOk if the data content is successfully read; otherwise, the method returns an appropriate error code.
\remarks
The successful result of force reading with not native schema for a file isn't guaranteed as different schemas may be not compatible with each other.

OdDAI.Repository.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates the repository from a specified STEP Physical File (*.spf).
\param fileName [in] A string that contains the file name.
\returns eOk if the data content is successfully read; otherwise, the method returns an appropriate error code.

OdDAI.Repository.getAnchorSection
\details
Retrieves the anchor section from the repository object.
\returns A reference to the AnchorSection object.

OdDAI.Repository.name(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assigns a name to the repository.
\param name [in] A string that contains the name.

OdDAI.Repository.name
Retrieves the current name of repository.
\returns
A string that contains the name.

OdDAI.Repository.#ctor
\details
Creates a new repository object with default parameters.

OdDAI.Repository
\details
A class that implements functionality for working with a repository within the Data Access Interface.
A repository is a collection of models, which represents the physical organization of a database.